{
  "url": "https://www.python.org/dev/core-mentorship/",
  "title": "Python Core Mentorship | Python.org",
  "content": "Python Core Mentorship | Python.org Notice: This page displays a fallback because interactive scripts did not run. Possible causes include disabled JavaScript or failure to load scripts or stylesheets. Skip to content ▼ Close Python PSF Docs PyPI Jobs Community ▲ The Python Network Donate ≡ Menu Search This Site GO A A Smaller Larger Reset Socialize LinkedIn Mastodon Chat on IRC Twitter About Applications Quotes Getting Started Help Python Brochure Downloads All releases Source code Windows macOS Android Other Platforms License Alternative Implementations Documentation Docs Audio/Visual Talks Beginner's Guide FAQ Non-English Docs PEP Index Python Books Python Essays Community Diversity Mailing Lists IRC Forums PSF Annual Impact Report Python Conferences Special Interest Groups Python Logo Python Wiki Code of Conduct Community Awards Get Involved Shared Stories Success Stories Arts Business Education Engineering Government Scientific Software Development News Python News PSF Newsletter PSF News PyCon US News News from the Community Events Python Events User Group Events Python Events Archive User Group Events Archive Submit an Event Python >>> Core Mentorship Python Core Mentorship Introduction The Python Core Mentorship Program is predicated on\nthe idea that Python core, and Python as a whole would be served by\nfurther lowering the barrier to entry of contribution to Python core\n( original proposal ) The mission of the Python Core Mentor Program is to provide an open\nand welcoming place to connect students, programmers â and anyone interested in contributing to the Python core\ndevelopment. This project is based on the idea that the best way to\nwelcome new people into any project is a venue which connects them to\na variety of mentors who can assist in guiding them through the\ncontribution process, including discussions on lists such as python-dev,\nand python-ideas, the bug tracker, Git questions, code reviews, etc. Additionally, mentors assist in something incredibly critical to\nmaintain contributor interest: getting patches through the process and actually committed . We all know â not everyone who is mentor will have all the\nanswers, so mentors also act as conduits to others who will have the\nanswer. The most important point to make is that everyone is welcome and no\none, no matter who they are, is turned away. Keep to the code of conduct, and\nhelp those around you. Resources The mailing list (signup there) The list archives (The current archive is only available to the list members.) The Python Developer's Guide should be your first stop - we will be adding to it based on feedback from the mentorship list The Python bug tracker you're going to want to bookmark it. The Python Discourse instance Code of Conduct The following code of conduct is not meant as a means for punishment, action\nor censorship for the mailing list or project. Instead, it is meant to set the\ntone and expectations and comfort level for mentors and those wishing to be\nmentored on the list. We ask everyone to be welcoming, friendly, and patient. Flame wars and insults are unacceptable in any fashion, by any party. Anything can be asked, and \"RTFM\" is not an acceptable answer. Neither is \"it's in the archives, go read them\". List archives are available only to subscribers, but subscription is open to everyone. Since the archives are \"closed\" - cross posting to public mailing lists is discouraged. Statements made by core developers can be quoted outside of the list. Statements made by others can not be quoted outside the list without explicit permission.\n- Anonymised paraphrased statements \"someone asked about...\" are OK - direct quotes with or without names are not appropriate. We endorse the PSF's Diversity statement The list administrators reserve the right to revoke the subscription of members (including mentors) that persistently fail to abide by this Code of Conduct.\n- All mentors are signed up as administrators. The PSF The Python Software Foundation is the organization behind Python. Become a member of the PSF and help advance the software and our mission. ▲ Back to Top About Applications Quotes Getting Started Help Python Brochure Downloads All releases Source code Windows macOS Android Other Platforms License Alternative Implementations Documentation Docs Audio/Visual Talks Beginner's Guide FAQ Non-English Docs PEP Index Python Books Python Essays Community Diversity Mailing Lists IRC Forums PSF Annual Impact Report Python Conferences Special Interest Groups Python Logo Python Wiki Code of Conduct Community Awards Get Involved Shared Stories Success Stories Arts Business Education Engineering Government Scientific Software Development News Python News PSF Newsletter PSF News PyCon US News News from the Community Events Python Events User Group Events Python Events Archive User Group Events Archive Submit an Event Contributing Developer's Guide Issue Tracker python-dev list Core Mentorship Report a Security Issue ▲ Back to Top Help & General Contact Diversity Initiatives Submit Website Bug Status Copyright ©2001-2026. Python Software Foundation Legal Statements Privacy Notice",
  "links": [
    "https://www.python.org/psf/conduct/",
    "https://www.python.org/dev/core-mentorship/",
    "https://www.python.org/dev/core-mentorship/#content",
    "https://www.python.org/dev/",
    "https://www.python.org/psf-landing/",
    "https://www.python.org/about/legal/",
    "https://www.python.org/success-stories/category/government/",
    "https://www.python.org/blogs/",
    "https://www.python.org/success-stories/category/business/",
    "https://www.python.org/about/quotes/",
    "https://www.python.org/psf/annual-report/2024/",
    "https://www.python.org/community/irc/",
    "https://www.python.org/community/sigs/",
    "https://www.python.org/success-stories/category/software-development/",
    "https://www.python.org/community/awards",
    "https://www.python.org/psf/",
    "https://www.python.org/dev/core-mentorship/#site-map",
    "https://www.python.org/psf/get-involved/",
    "https://www.python.org/psf/community-stories/",
    "https://www.python.org/community/diversity/",
    "https://www.python.org/community/workshops/",
    "https://www.python.org/downloads/",
    "https://www.python.org/success-stories/category/education/",
    "https://www.python.org/psf/diversity/",
    "https://www.python.org/downloads/android/",
    "https://www.python.org/success-stories/category/scientific/",
    "https://www.python.org/downloads/source/",
    "https://www.python.org/events/python-user-group/",
    "https://www.python.org/dev/core-mentorship/#top",
    "https://www.python.org/",
    "https://www.python.org/doc/essays/",
    "https://www.python.org/community/logos/",
    "https://www.python.org/events/python-events/",
    "https://www.python.org/events/python-events/past/",
    "https://www.python.org/events/python-user-group/past/",
    "https://www.python.org/dev/security/",
    "https://www.python.org/download/alternatives",
    "https://www.python.org/doc/",
    "https://www.python.org/success-stories/",
    "https://www.python.org/success-stories/category/arts/",
    "https://www.python.org/about/apps/",
    "https://www.python.org/jobs/",
    "https://www.python.org/about/help/",
    "https://www.python.org/community/",
    "https://www.python.org/dev/core-mentorship/#python-network",
    "https://www.python.org/downloads/macos/",
    "https://www.python.org/success-stories/category/engineering/",
    "https://www.python.org/about/",
    "https://www.python.org/about/gettingstarted/",
    "https://www.python.org/events/",
    "https://www.python.org/download/other/",
    "https://www.python.org/community/lists/",
    "https://www.python.org/psf/newsletter/",
    "https://www.python.org/doc/av",
    "https://www.python.org/community/forums/",
    "https://www.python.org/downloads/windows/"
  ]
}