{
  "url": "https://www.python.org/about/quotes/",
  "title": "Quotes about Python | Python.org",
  "content": "Quotes about Python | Python.org Notice: This page displays a fallback because interactive scripts did not run. Possible causes include disabled JavaScript or failure to load scripts or stylesheets. Skip to content ▼ Close Python PSF Docs PyPI Jobs Community ▲ The Python Network Donate ≡ Menu Search This Site GO A A Smaller Larger Reset Socialize LinkedIn Mastodon Chat on IRC Twitter About Applications Quotes Getting Started Help Python Brochure Downloads All releases Source code Windows macOS Android Other Platforms License Alternative Implementations Documentation Docs Audio/Visual Talks Beginner's Guide FAQ Non-English Docs PEP Index Python Books Python Essays Community Diversity Mailing Lists IRC Forums PSF Annual Impact Report Python Conferences Special Interest Groups Python Logo Python Wiki Code of Conduct Community Awards Get Involved Shared Stories Success Stories Arts Business Education Engineering Government Scientific Software Development News Python News PSF Newsletter PSF News PyCon US News News from the Community Events Python Events User Group Events Python Events Archive User Group Events Archive Submit an Event Python >>> About >>> Quotes Quotes about Python Python is used successfully in thousands of real-world business\napplications around the world, including many large and mission\ncritical systems.  Here are some quotes from happy Python users: YouTube.com \"Python is fast enough for our site and allows us to produce\nmaintainable features in record times, with a minimum of developers,\"\nsaid Cuong Do, Software Architect, YouTube.com . Industrial Light & Magic \"Python plays a key role in our production pipeline.  Without it a\nproject the size of Star Wars: Episode II would have been very\ndifficult to pull off. From crowd rendering to batch processing to\ncompositing, Python binds all things together,\" said Tommy Burnette,\nSenior Technical Director, Industrial Light & Magic . \"Python is everywhere at ILM. It's used to extend the capabilities\nof our applications, as well as providing the glue between them. Every\nCG image we create has involved Python somewhere in the process,\" said\nPhilip Peterson, Principal Engineer, Research & Development, Industrial Light & Magic . Google \"Python has been an important part of Google since the beginning,\nand remains so as the system grows and evolves. Today dozens of Google\nengineers use Python, and we're looking for more people with skills in\nthis language.\" said Peter Norvig, director of search quality at Google, Inc. Journyx \"Journyx technology, from the source code of our software to the code that\nmaintains our Web site and ASP sites, is entirely based on Python. It\nincreases our speed of development and keeps us several steps ahead of\ncompetitors while remaining easy to read and use.  It's as high level of a\nlanguage as you can have without running into functionality problems.  I\nestimate that Python makes our coders 10 times more productive than Java\nprogrammers, and 100 times more than C programmers.\" -- Curt Finch, CEO, Journyx IronPort \"IronPort email gateway appliances are used by the largest\ncorporations and ISPs in the world,\" said Mark Peek, Sr. Director of\nEngineering at IronPort Systems .  \"Python\nis a critical ingredient in this high performance system. IronPort's\nsuite of products contains over a million lines of Python. The PSF is\nan invaluable resource that helps keep Python on the cutting edge.\" EVE Online \"Python enabled us to create EVE Online ,\na massive multiplayer game, in record\ntime. The EVE Online server cluster runs over 50,000 simultaneous players\nin a shared space simulation, most of which is created in Python. The\nflexibilities of Python have enabled us to quickly improve the game\nexperience based on player feedback\" said\nHilmar Veigar Petursson of CCP Games . HomeGain \"HomeGain maintains its commitment to continual improvement through\nrapid turnaround of new features and enhancements.  Python supports\nthis short time-to-market philosophy with concise, clear syntax and a\npowerful standard library.  New development proceeds rapidly, and\nmaintenance of existing code is straightforward and fast,\" said Geoff\nGerrietts, Software Engineer, HomeGain.com . Thawte Consulting \"Python makes us extremely productive, and makes\nmaintaining a large and rapidly evolving codebase relatively\nsimple,\" said Mark Shuttleworth. University of Maryland \"I have the students learn Python in our undergraduate and graduate\nSemantic Web courses.  Why?  Because basically there's nothing else\nwith the flexibility and as many web libraries,\" said Prof. James\nA. Hendler. EZTrip.com \"The travel industry is made up of a myriad supplier data feeds all of\nwhich are proprietary in some way and are constantly changing.   Python\nrepeatedly has allowed us to access, build and test our in-house\ncommunications with hundreds of travel suppliers around the world in a\nmatter of days rather then the months it would have taken using other\nlanguages.  Since adopting Python 2 years ago, Python has provided us\nwith a measurable productivity gain that allows us to stay competitive\nin the online travel space,\" said Michael Engelhart, CTO of EZTrip.com . RealEstateAgent.com \"Python in conjunction with PHP has repeatedly allowed us to develop\nfast and proficient applications that permit Real Estate Agent .com to operate with minimal\nresources. Python is a critical part of our dynamically growing\ncluster directory of real estate agents.\" said Gadi Hus, Webmaster, Volico Web Consulting Firaxis Games \"Like XML, scripting was extremely useful as both a mod tool and an\ninternal development tool.  If you don't have any need to expose code\nand algorithms in a simple and safe way to others, you can argue that\nproviding a scripting language is not worth the effort.  However, if\nyou do have that need, as we did, scripting is a no brainer, and it\nmakes complete sense to use a powerful, documented, cross-platform\nstandard such as Python.\"  -- Mustafa Thamer of Firaxis Games, talking\nabout Civilization IV.  Quoted on page 18 of the August 2005 Game Developer Magazine . \"Python, like many good technologies, soon spreads virally throughout\nyour development team and finds its way into all sorts of applications\nand tools.  In other words, Python begins to feel like a big hammer and\ncoding tasks look like nails.\"\n-- Mustafa Thamer of Firaxis Games, talking about Civilization IV.\nQuoted on page 18 of the August 2005 Game Developer Magazine . \"We chose to use python because we wanted a well-supported scripting\nlanguage that could extend our core code. Indeed, we wrote much more\ncode in python than we were expecting, including all in-game screens\nand the main interface. It was a huge win for the project because\nwriting code in a language with garbage collection simply goes faster\nthan writing code in C++. The fact that users will be able to easily\nmod the interface is a nice plus as well. The downside of python was\nthat it significantly increased our build times, mostly from linking\nwith Boost.\" -- Soren Johnson, lead designer, Civilization IV.  Quoted\nin a Slashdot interview . The PSF The Python Software Foundation is the organization behind Python. Become a member of the PSF and help advance the software and our mission. ▲ Back to Top About Applications Quotes Getting Started Help Python Brochure Downloads All releases Source code Windows macOS Android Other Platforms License Alternative Implementations Documentation Docs Audio/Visual Talks Beginner's Guide FAQ Non-English Docs PEP Index Python Books Python Essays Community Diversity Mailing Lists IRC Forums PSF Annual Impact Report Python Conferences Special Interest Groups Python Logo Python Wiki Code of Conduct Community Awards Get Involved Shared Stories Success Stories Arts Business Education Engineering Government Scientific Software Development News Python News PSF Newsletter PSF News PyCon US News News from the Community Events Python Events User Group Events Python Events Archive User Group Events Archive Submit an Event Contributing Developer's Guide Issue Tracker python-dev list Core Mentorship Report a Security Issue ▲ Back to Top Help & General Contact Diversity Initiatives Submit Website Bug Status Copyright ©2001-2026. Python Software Foundation Legal Statements Privacy Notice",
  "links": [
    "https://www.python.org/about/quotes/#site-map",
    "https://www.python.org/psf/conduct/",
    "https://www.python.org/dev/core-mentorship/",
    "https://www.python.org/about/quotes/#python-network",
    "https://www.python.org/about/quotes/#top",
    "https://www.python.org/psf-landing/",
    "https://www.python.org/dev/",
    "https://www.python.org/about/quotes/#content",
    "https://www.python.org/about/legal/",
    "https://www.python.org/success-stories/category/government/",
    "https://www.python.org/blogs/",
    "https://www.python.org/success-stories/category/business/",
    "https://www.python.org/about/quotes/",
    "https://www.python.org/psf/annual-report/2024/",
    "https://www.python.org/community/irc/",
    "https://www.python.org/community/sigs/",
    "https://www.python.org/success-stories/category/software-development/",
    "https://www.python.org/community/awards",
    "https://www.python.org/psf/",
    "https://www.python.org/psf/get-involved/",
    "https://www.python.org/psf/community-stories/",
    "https://www.python.org/community/diversity/",
    "https://www.python.org/community/workshops/",
    "https://www.python.org/downloads/",
    "https://www.python.org/success-stories/category/education/",
    "https://www.python.org/downloads/android/",
    "https://www.python.org/success-stories/category/scientific/",
    "https://www.python.org/downloads/source/",
    "https://www.python.org/events/python-user-group/",
    "https://www.python.org/community/logos/",
    "https://www.python.org/",
    "https://www.python.org/doc/essays/",
    "https://www.python.org/events/python-events/",
    "https://www.python.org/events/python-events/past/",
    "https://www.python.org/events/python-user-group/past/",
    "https://www.python.org/dev/security/",
    "https://www.python.org/download/alternatives",
    "https://www.python.org/doc/",
    "https://www.python.org/success-stories/",
    "https://www.python.org/success-stories/category/arts/",
    "https://www.python.org/about/apps/",
    "https://www.python.org/jobs/",
    "https://www.python.org/about/help/",
    "https://www.python.org/community/",
    "https://www.python.org/downloads/macos/",
    "https://www.python.org/success-stories/category/engineering/",
    "https://www.python.org/about/",
    "https://www.python.org/about/gettingstarted/",
    "https://www.python.org/events/",
    "https://www.python.org/download/other/",
    "https://www.python.org/community/lists/",
    "https://www.python.org/psf/newsletter/",
    "https://www.python.org/doc/av",
    "https://www.python.org/community/forums/",
    "https://www.python.org/downloads/windows/"
  ]
}